# Apps
cask "ghostty" # terminal
cask "raycast" # app launcher
cask "rectangle" # window resizing
cask "google-chrome" # web browser
cask "firefox" # web browser
cask "visual-studio-code" # text editor
cask "docker" # containerization
cask "obsidian" # notes
cask "spotify" # music
cask "discord" # communication

# Dev Tools
brew "neovim" # text editor
brew "git" # version control
brew "cloc" # count lines of code
brew "postgresql" # database

# Python
brew "xz" # Python dependencies
brew "pyenv" # Python version manager